## 一、apply的应用

In [1]:
import numpy as np
import pandas as pd
from numpy import random

In [2]:
df = pd.DataFrame(np.random.randint(0,20,15).reshape(3,5),columns = ['a','b','c','d','e'],index=['A','B','C'])

In [3]:
df

    a   b   c   d   e
A   9  17  12  10   9
B   0  15  13  11  14
C  16  12   0   9  13

In [4]:
df.apply(lambda x:x+3) #便利df的每一行

    a   b   c   d   e
A  12  20  15  13  12
B   3  18  16  14  17
C  19  15   3  12  16

In [5]:
df['a'].apply(lambda x:x*2) #也可以使单独一行

A    18
B     0
C    32
Name: a, dtype: int64

In [9]:
df.iloc[[1],[2]].apply(lambda x:x+2)#也可以单独一个数

    c
B  15

In [16]:
df.iloc[[2]].apply(lambda x:x+2) #也可以单独一行

    a   b  c   d   e
C  18  14  2  11  15

## assign 的方法

In [26]:
df.assign(a=lambda x:x+3)  #使a那一列的数据都+3

    a   b   c   d   e
A  12  17  12  10   9
B   3  15  13  11  14
C  19  12   0   9  13

In [27]:
df

    a   b   c   d   e
A   9  17  12  10   9
B   0  15  13  11  14
C  16  12   0   9  13

In [36]:
df.assign(f=lambda df:df['a']*df['b'])  #可以新加一列 这一列是a+b的和

    a   b   c   d   e    f
A   9  17  12  10   9  153
B   0  15  13  11  14    0
C  16  12   0   9  13  192

In [39]:
df['g'] = df['a']+df['b'] #新加一列

In [40]:
df

    a   b   c   d   e   g
A   9  17  12  10   9  26
B   0  15  13  11  14  15
C  16  12   0   9  13  28

In [45]:
df.iloc[[1],[2]].assign(c = lambda df:df+3) #也可以单独改一个数据

    c
B  16

In [46]:
df.iloc[[1],[2]].assign(f = lambda df:df+3) #可以单独改一个数据并将那个数据重新命名

    c   f
B  13  16

In [44]:
df

    a   b   c   d   e   g
A   9  17  12  10   9  26
B   0  15  13  11  14  15
C  16  12   0   9  13  28

# 异同点

1、都可以修改数据

2、apply不可以新建，assign可以新建数据 （assign新建的是一列，）